---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LinesOverlapPath3d
source: html/b9e3793d-eb56-c0bb-3b1f-f53933491749.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LinesOverlapPath3d Property

Cannot have overlapping lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId LinesOverlapPath3d { get; }
```